{
  "backend/main.mo": "Main backend canister implementing destinations, transport options, users, bookings, and contact inquiries with access control and migration support.",
  "backend/migration.mo": "Migration module converting old booking records to include the new transportOptionId field and initializing new transport option state.",
  "feature_evidence.json": "Feature evidence metadata linking feature IDs to affected frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including pages, hooks, layout, and global styles.",
  "frontend/index.css": "Tailwind base/theme definitions setting OKLCH color variables and global styling for light and dark modes.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines the TanStack Router setup and routes for all main pages wrapped in the SiteLayout.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout with header, navigation, mobile menu, and footer wrapping all pages.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication, including login, logout, and loading stored identities. Wraps Dfinity AuthClient with custom options and exposes status helpers.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching destinations, transport options, inquiries, and creating bookings. Integrates backend actor calls with caching and error mapping.",
  "frontend/src/index.css": "Defines Tailwind base, component, and utility layers with custom CSS variables for light and dark themes. Applies global styling tokens for colors, borders, and typography.",
  "frontend/src/main.tsx": "Initializes the React app by setting up QueryClientProvider and InternetIdentityProvider before rendering App. Imports global CSS and configures query client.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static About page describing DreamDestination's mission and features using cards and icons. Provides styled informational content about the service vision.",
  "frontend/src/pages/BookingPage.tsx": "Implements the booking workflow with identity checks, form validation, prefilled data, and booking submission via hooks. Displays past bookings and handles transport option constraints.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation and submission to backend inquiries. Shows contact information cards and handles success and error UI states.",
  "frontend/src/pages/DestinationDetailsPage.tsx": "Renders detailed info for a selected destination, including location, image, transport options, and booking navigation with auth checks and loading/error states.",
  "frontend/src/pages/DestinationsPage.tsx": "Displays a grid of destinations with images, descriptions, and links to detail pages, including loading skeletons and error handling.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage with a hero section, marketing content, and links to explore destinations or contact the site.",
  "frontend/src/pages/LoginPage.tsx": "Manages Internet Identity authentication with sign‑in, sign‑out, status feedback, and error handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and container settings with plugins enabled.",
  "project_state.json": "Holds the current project state, including schema version, summary, architectural notes, and a list of existing implemented features. Serves as the central metadata record for tracking versions and requirements of the DreamDestination app."
}